'''
！！！！！好题！！！！
给定一个数组和滑动窗口的大小，找出所有滑动窗口里数值的最大值。
例如，如果输入数组{2,3,4,2,6,2,5,1}及滑动窗口的大小3，那么一共存在6个滑动窗口，他们的最大值分别为{4,4,6,6,6,5}； 
针对数组{2,3,4,2,6,2,5,1}的滑动窗口有以下6个： 
{[2,3,4],2,6,2,5,1}，
{2,[3,4,2],6,2,5,1}，
{2,3,[4,2,6],2,5,1}，
{2,3,4,[2,6,2],5,1}，
{2,3,4,2,[6,2,5],1}，
{2,3,4,2,6,[2,5,1]}。
窗口大于数组长度的时候，返回空
'''

# 单调栈
# 思想：在窗口中，只有更大的数是影响结果的
def maxInWindows(self, num, size):
    # write code here
    q = []
    res = []
    if len(num) == 0 or size < 1 or len(num) < size:
        return []
    for i in range(len(num)):
        while q and num[q[-1]] < num[i]:
            q.pop()
        q.append(i)
        if q[0] + size <= i:
            q.pop(0)
        if i+1 >= size:
            res.append(num[q[0]])
    return res